In [27]:
import pandas as pd

In [28]:
data = {
    'Name': ['Gimbiya', 'Alice', 'Aisha'],
    'Age': [27, 30, 35],
    'City': ['London', 'New york', 'Dubai']
}

In [29]:
df = pd.DataFrame(data)

In [21]:
print(df)

      Name  Age      City
0  Gimbiya   27    London
1    Alice   30  New york
2    Aisha   35     Dubai

In [5]:
print(df['Name'])

0    Gimbiya
1      Alice
2      Aisha
Name: Name, dtype: object

In [6]:
print(df.iloc[2])

Name    Aisha
Age        35
City    Dubai
Name: 2, dtype: object

In [8]:
print(df[1:4])

    Name  Age      City
1  Alice   30  New york
2  Aisha   35     Dubai

In [30]:
df['Salary'] = [50000, 54000, 50000]
print(df)

      Name  Age      City  Salary
0  Gimbiya   27    London   50000
1    Alice   30  New york   54000
2    Aisha   35     Dubai   50000

In [31]:
df.loc[df['Age'] > 40, 'Salary'] = 65000
print(df)

      Name  Age      City  Salary
0  Gimbiya   27    London   50000
1    Alice   30  New york   54000
2    Aisha   35     Dubai   50000

In [24]:
df.drop('Age', axis=1, inplace=True)
print(df)

      Name      City  Salary
0  Gimbiya    London   50000
1    Alice  New york   54000
2    Aisha     Dubai   50000

In [32]:
# Without modifying the original DataFrame
new_df = df.drop('Age', axis=1)
print(new_df.head()) # Show the DataFrame without the 'Age' column.
print(df.head())     # Original DataFrame remains unchanged.

      Name      City  Salary
0  Gimbiya    London   50000
1    Alice  New york   54000
2    Aisha     Dubai   50000
      Name  Age      City  Salary
0  Gimbiya   27    London   50000
1    Alice   30  New york   54000
2    Aisha   35     Dubai   50000

In [33]:
# Calculating the sum of the 'Salary' column across all rows
total_salary = df['Salary'].sum(axis=0) # Axis=0 is default here, sums down the rows for 'Salary' column.
print(total_salary)

154000